# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
nsegcls: 8
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
Backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
DetHead:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4 /16
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3 /8
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]

RoadSegHead:
  [ [ 16, 1, Conv, [256, 128, 3, 1]],   #25  /8
    [ -1, 1, nn.Upsample, [None, 2, 'nearest']],  #26 /4
    [ -1, 1, C3, [128, 64, 1, False]],  #27
    [ -1, 1, Conv, [64, 32, 3, 1]],    #28
    [ -1, 1, nn.Upsample, [None, 2, 'nearest']],  #29 /2
    [ -1, 1, Conv, [32, 16, 3, 1]],    #30
    [ -1, 1, C3, [16, 8, 1, False]],    #31
    [ -1, 1, nn.Upsample, [None, 2, 'nearest']],  #32 /1
    [ -1, 1, Conv, [8, nsegcls, 3, 1]], #33 road segmentation head
  ]

PresetAreaHead:
  [ [ -1, 1, Conv, [8, 1, 3, 1]] #42 Preset area segmentation head,  sigmoid or softmax?
  ]

